import csv

center_links = ["Белгородская область", "Брянская область", "Ивановская область",
                "Калужская область", "Костромская область", "Смоленская область", "Орловская область",
                "Ярославская область", "Липецкая область", "Владимирская область", "Воронежская область",
                "Рязанская область", "Тамбовская область", "Тверская область", "Тульская область", "Курская область",
                "Московская область", "Москва (регион)", "Ленинградская область", "Санкт-Петербург (регион)",
                "Пермский край", "Нижегородская область", "Оренбургская область", "Саратовская область",
                "Татарстан республика", "Кировская область", "Пензенская область", "Самарская область",
                "Ульяновская область", "Марий Эл республика", "Башкортостан республика", "Мордовия республика",
                "Удмуртская Республика", "Чувашия республика", "Волгоградская область", "Краснодарский край",
                "Калмыкия республика", "Ростовская область", "Астраханская область", "Адыгея республика",
                "Крым республика",
                ]

dict = {}

for i in center_links:
    dict[i] = set()

with open("Data2.csv", mode='r', encoding='utf-8') as csv_file:
    csv_reader = csv.reader(csv_file, delimiter=';')
    count_users = set()
    csv_reader.__next__()
    for row in csv_reader:
        try:
            dict[row[0]].add(row[7])
        except Exception:
            pass

with open("CountUniqueUsers2.csv", mode='w') as write_file:
    fieldnames = [
        'Область',
        'Количество уникальных юзеров',
    ]
    writer = csv.DictWriter(write_file, delimiter=';', fieldnames=fieldnames)
    writer.writeheader()
    for i in dict:
        writer.writerow({
            'Область': i,
            'Количество уникальных юзеров': len(dict[i])
        })

print("Done")
